Repository: TrueAlpha0902/NextStep-iOS-CI
Catalog: Sources/NotesApp/Resources/Localizable.xcstrings
Source language: en
Languages: zh_hant

source: \(studySet.cards.count) total
zh_hant: 共 \(studySet.cards.count) 張

source: %lld of %lld
zh_hant: 已完成 %lld / %lld

source: %lld of %lld cards
zh_hant: 已完成 %lld / %lld 張學習卡

source: %lld total
zh_hant: 共 %lld 張

source: A study card needs both a prompt and an answer.
zh_hant: 學習卡必須同時有題目和答案。

source: Add a block to start writing.
zh_hant: 新增區塊即可開始書寫。

source: Add a card, then enter both a prompt and an answer.
zh_hant: 新增學習卡，然後輸入題目與答案。

source: Add block
zh_hant: 新增區塊

source: Add block below
zh_hant: 在下方新增區塊

source: Add card
zh_hant: 新增學習卡

source: Add text block
zh_hant: 新增文字區塊

source: Again
zh_hant: 再來一次

source: Answer
zh_hant: 答案

source: Block actions
zh_hant: 區塊操作

source: Block style
zh_hant: 區塊樣式

source: Card answer
zh_hant: 學習卡答案

source: Card hint
zh_hant: 學習卡提示

source: Card prompt
zh_hant: 學習卡題目

source: Card tags
zh_hant: 學習卡標籤

source: Cards
zh_hant: 學習卡

source: Choose a card from the list to edit it.
zh_hant: 請從列表中選擇要編輯的學習卡。

source: Comma-separated tags
zh_hant: 以逗號分隔的標籤

source: Couldn’t load page content
zh_hant: 無法載入頁面內容

source: Delete
zh_hant: 刪除

source: Delete block
zh_hant: 刪除區塊

source: Delete card
zh_hant: 刪除學習卡

source: Document save failed. Retry save
zh_hant: 文件儲存失敗。重試儲存

source: Document saved
zh_hant: 文件已儲存

source: Duplicate
zh_hant: 複製

source: Duplicate card
zh_hant: 複製學習卡

source: Easy
zh_hant: 簡單

source: Edit Card
zh_hant: 編輯學習卡

source: Empty text document
zh_hant: 空白文字文件

source: Enter the answer
zh_hant: 輸入答案

source: Good
zh_hant: 良好

source: Hard
zh_hant: 困難

source: Hint
zh_hant: 提示

source: Indent
zh_hant: 增加縮排

source: Last edited
zh_hant: 上次編輯

source: Loading document
zh_hant: 正在載入文件

source: Loading study set
zh_hant: 正在載入學習卡集

source: Move down
zh_hant: 下移

source: Move up
zh_hant: 上移

source: New note
zh_hant: 新增筆記

source: No cards
zh_hant: 尚無學習卡

source: No cards ready
zh_hant: 沒有可複習的學習卡

source: Note
zh_hant: 筆記

source: Note type
zh_hant: 筆記類型

source: Optional hint
zh_hant: 選填提示

source: Outdent
zh_hant: 減少縮排

source: Prompt
zh_hant: 題目

source: Rate your answer
zh_hant: 評價你的答案

source: Refresh Queue
zh_hant: 重新整理複習清單

source: Replace with divider
zh_hant: 替換為分隔線

source: Retry save
zh_hant: 重試儲存

source: Reveal Answer
zh_hant: 顯示答案

source: Saving document
zh_hant: 正在儲存文件

source: Separate multiple tags with commas.
zh_hant: 多個標籤請用逗號分隔。

source: Show hint
zh_hant: 顯示提示

source: Study cards
zh_hant: 學習卡列表

source: Study progress
zh_hant: 學習進度

source: Study session
zh_hant: 複習階段

source: Study set
zh_hant: 學習卡集

source: Study set mode
zh_hant: 學習卡集模式

source: Text document
zh_hant: 文字文件

source: The saved content could not be opened. Your existing data was not replaced.
zh_hant: 無法開啟已儲存的內容。現有資料未被取代。

source: The structured page content is unavailable and cannot be duplicated.
zh_hant: 結構化頁面內容無法使用，因此不能複製。

source: The text in this block will be removed.
zh_hant: 此區塊中的文字將被移除。

source: There are no cards due for review right now.
zh_hant: 目前沒有需要複習的學習卡。

source: There are no cards due now. \(incompleteCount) incomplete cards were skipped.
zh_hant: 目前沒有需要複習的學習卡。已略過 \(incompleteCount) 張未完成的卡片。

source: There are no cards due now. %lld incomplete cards were skipped.
zh_hant: 目前沒有需要複習的學習卡。已略過 %lld 張未完成的卡片。

source: Try again
zh_hant: 再試一次

source: Type
zh_hant: 類型

source: What do you want to remember?
zh_hant: 你想記住什麼？

source: You're caught up
zh_hant: 你已完成所有複習

source: Tool
zh_hant: 工具

source: What do you want to know?
zh_hant: 你想知道什麼？

source: A local model with this identifier is already installed: %@
zh_hant: 已安裝具有此識別碼的本機模型：%@

source: Choose a model folder that contains model.json and its listed files.
zh_hant: 請選擇包含 model.json 與其中所列檔案的模型資料夾。

source: Import local model folder
zh_hant: 匯入本機模型資料夾

source: Importing and verifying local model…
zh_hant: 正在匯入並驗證本機模型…

source: Last verified
zh_hant: 上次驗證

source: Local model problem
zh_hant: 本機模型發生問題

source: No local models installed
zh_hant: 尚未安裝本機模型

source: NextStep never uploads imported model files and does not include a paid or remote model catalog. Import reads only files listed in model.json, enforces storage limits, and verifies every SHA-256 checksum. This build manages verified model artifacts; on-device text generation is not connected yet.
zh_hant: NextStep 不會上傳匯入的模型檔案，也不提供付費或遠端模型目錄。匯入時只會讀取 model.json 所列的檔案、限制儲存空間，並驗證每個 SHA-256 校驗碼。此版本可管理已驗證的模型檔案；尚未連接裝置端文字生成功能。

source: On-device models
zh_hant: 裝置端模型

source: Remove
zh_hant: 移除

source: Remove Model
zh_hant: 移除模型

source: Remove this local model?
zh_hant: 要移除此本機模型嗎？

source: Removing local model…
zh_hant: 正在移除本機模型…

source: SHA-256 verification failed for the model file: %@
zh_hant: 模型檔案的 SHA-256 驗證失敗：%@

source: The local model contains an unsafe path: %@
zh_hant: 本機模型包含不安全的路徑：%@

source: The local model exceeds the 16 GB safety limit.
zh_hant: 本機模型超過 16 GB 的安全上限。

source: The local model folder is unavailable.
zh_hant: 本機模型資料夾無法使用。

source: The local model package is invalid.
zh_hant: 本機模型套件無效。

source: The model file is larger than its declared safety limit: %@
zh_hant: 模型檔案超過其宣告的安全上限：%@

source: The verified model files will be deleted from NextStep. Your notebooks are not affected.
zh_hant: 已驗證的模型檔案將從 NextStep 刪除；你的筆記本不會受到影響。

source: Verified
zh_hant: 已驗證

source: Verifying local models…
zh_hant: 正在驗證本機模型…

source: Verify installed models
zh_hant: 驗證已安裝的模型

source: Version %@ • declared %@
zh_hant: 版本 %@ • 宣告大小 %@

source: %@ placeholder
zh_hant: %@ 預留位置

source: %@, locked
zh_hant: %@，已鎖定

source: Add to selection
zh_hant: 加入選取項目

source: Address
zh_hant: 網址

source: Arrow
zh_hant: 箭頭

source: Bring to front
zh_hant: 移到最上層

source: Circle
zh_hant: 圓形

source: Clear selection
zh_hant: 清除選取

source: Connector
zh_hant: 連接線

source: Edit
zh_hant: 編輯

source: Ellipse
zh_hant: 橢圓形

source: Embedded image
zh_hant: 內嵌圖片

source: Embedded sticker
zh_hant: 內嵌貼圖

source: Empty
zh_hant: 空白

source: Finish multiple selection
zh_hant: 完成多重選取

source: Hidden
zh_hant: 已遮住

source: Hide tape
zh_hant: 蓋回膠帶

source: Image
zh_hant: 圖片

source: Line
zh_hant: 線條

source: Link
zh_hant: 連結

source: Lock
zh_hant: 鎖定

source: Rectangle
zh_hant: 矩形

source: Remove from selection
zh_hant: 從選取項目移除

source: Resize
zh_hant: 調整大小

source: Reveal tape
zh_hant: 揭開膠帶

source: Revealed
zh_hant: 已揭開

source: Rotate
zh_hant: 旋轉

source: Rounded rectangle
zh_hant: 圓角矩形

source: Select
zh_hant: 選取

source: Select multiple
zh_hant: 多重選取

source: Send to back
zh_hant: 移到最下層

source: Shape
zh_hant: 圖形

source: Sticker
zh_hant: 貼圖

source: Sticky note
zh_hant: 便利貼

source: Tape
zh_hant: 膠帶

source: Text
zh_hant: 文字

source: This element has no editable text.
zh_hant: 此元素沒有可編輯的文字。

source: Add element
zh_hant: 新增元素

source: Add link
zh_hant: 新增連結

source: Could not load canvas elements
zh_hant: 無法載入畫布元素

source: Could not load ink
zh_hant: 無法載入筆跡

source: Edit elements
zh_hant: 編輯元素

source: Enter a complete HTTP or HTTPS address.
zh_hant: 請輸入完整的 HTTP 或 HTTPS 位址。

source: Image asset %lld
zh_hant: 圖片素材 %lld

source: Link title
zh_hant: 連結標題

source: No image assets available
zh_hant: 沒有可用的圖片素材

source: The drawing remains available and existing elements were not replaced.
zh_hant: 繪圖仍可使用，現有元素並未被取代。

source: This page stays read-only until its saved ink can be loaded safely.
zh_hant: 在安全載入已儲存的筆跡前，此頁將保持唯讀。

source: The latest canvas elements could not be saved: %@
zh_hant: 無法儲存最新的畫布元素：%@

source: %lld of %lld export steps complete
zh_hant: %lld / %lld 個匯出步驟已完成

source: An image on page %lld could not be opened for PDF export.
zh_hant: 無法開啟第 %lld 頁的圖片以匯出 PDF。

source: Cancel notebook PDF export
zh_hant: 取消整本 PDF 匯出

source: Export notebook PDF
zh_hant: 匯出整本 PDF

source: Exporting notebook PDF
zh_hant: 正在匯出整本 PDF

source: Page %lld cannot be included in a notebook PDF.
zh_hant: 第 %lld 頁無法加入整本 PDF。

source: Save every pending edit before exporting the notebook.
zh_hant: 匯出整本筆記前，請先儲存所有待處理的編輯。

source: Shares every page as one PDF in notebook order
zh_hant: 依筆記頁面順序，將所有頁面合併成一份 PDF 分享

source: The background on page %lld could not be opened for PDF export.
zh_hant: 無法開啟第 %lld 頁的背景以匯出 PDF。

source: The elements on page %lld could not be opened for PDF export.
zh_hant: 無法開啟第 %lld 頁的元素以匯出 PDF。

source: The notebook changed while its PDF was being prepared. Try again.
zh_hant: 準備 PDF 時筆記已變更。請再試一次。

source: The saved notebook could not be opened for PDF export.
zh_hant: 無法開啟已儲存的筆記以匯出 PDF。

source: Cancelling notebook PDF export
zh_hant: 正在取消整本 PDF 匯出

source: Page %lld has invalid dimensions for PDF export.
zh_hant: 第 %lld 頁的尺寸無法用於 PDF 匯出。

source: Temporary PDF page %lld could not be verified.
zh_hant: 無法驗證暫存的第 %lld 頁 PDF。

source: The ink on page %1$lld exceeds the %2$lld MB PDF export limit.
zh_hant: 第 %1$lld 頁的筆跡超過 %2$lld MB 的 PDF 匯出上限。

source: The PDF export destination is not safe.
zh_hant: PDF 匯出目的地不安全。

source: There is not enough free space to export this notebook PDF.
zh_hant: 可用空間不足，無法匯出整本 PDF。

source: This notebook has no pages to export.
zh_hant: 這本筆記沒有可匯出的頁面。

source: This notebook has too many pages to export as one PDF.
zh_hant: 這本筆記的頁數太多，無法匯出成單一 PDF。

source: This notebook PDF is too large to export safely.
zh_hant: 整本 PDF 過大，無法安全匯出。

source: This page's ink data exceeds the %lld MB export limit.
zh_hant: 此頁的筆跡資料超過 %lld MB 的匯出上限。

source: This page's ink data is damaged and cannot be exported.
zh_hant: 此頁面的筆跡資料已損毀，無法匯出。

source: This page's ink is too complex to export safely.
zh_hant: 此頁面的筆跡過於複雜，無法安全匯出。

source: This page has more than %lld elements and cannot be exported.
zh_hant: 此頁含有超過 %lld 個元素，無法匯出。

source: The ink data on page %lld is damaged and cannot be exported.
zh_hant: 第 %lld 頁的筆跡資料已損毀，無法匯出。

source: The ink on page %lld is too complex to export safely.
zh_hant: 第 %lld 頁的筆跡過於複雜，無法安全匯出。

source: Page %1$lld has more than %2$lld elements and cannot be exported.
zh_hant: 第 %1$lld 頁含有超過 %2$lld 個元素，無法匯出。

source: This page's background file is missing or unsafe.
zh_hant: 此頁的背景檔案遺失或不安全。

source: This page's background file exceeds the %lld MB export limit.
zh_hant: 此頁的背景檔案超過 %lld MB 的匯出上限。

source: This page's background file is damaged or unsupported.
zh_hant: 此頁的背景檔案已損毀或不受支援。

source: This page's selected PDF background page is unavailable.
zh_hant: 此頁所選的 PDF 背景頁面無法使用。

source: The ink on page %lld could not be opened for PDF export.
zh_hant: 無法開啟第 %lld 頁的筆跡以匯出 PDF。

source: The background file on page %lld is missing or unsafe.
zh_hant: 第 %lld 頁的背景檔案遺失或不安全。

source: The background file on page %1$lld exceeds the %2$lld MB PDF export limit.
zh_hant: 第 %1$lld 頁的背景檔案超過 %2$lld MB 的 PDF 匯出上限。

source: The background file on page %lld is damaged or unsupported.
zh_hant: 第 %lld 頁的背景檔案已損毀或不受支援。

source: The selected PDF background for page %lld is unavailable.
zh_hant: 第 %lld 頁所選的 PDF 背景無法使用。

source: Recording (M4A)
zh_hant: 錄音（M4A）

source: Transcript (TXT)
zh_hant: 逐字稿（TXT）

source: Subtitles (SRT)
zh_hant: 字幕（SRT）

source: Exporting
zh_hant: 正在匯出

source: Export
zh_hant: 匯出

source: Export failed
zh_hant: 匯出失敗

source: Searching transcript
zh_hant: 正在搜尋逐字稿

source: Search transcript
zh_hant: 搜尋逐字稿

source: Clear transcript search
zh_hant: 清除逐字稿搜尋

source: No matches
zh_hant: 找不到符合項目

source: Try a different word or phrase.
zh_hant: 請嘗試其他字詞或片語。

source: Search was limited to keep this transcript responsive.
zh_hant: 為保持逐字稿操作順暢，搜尋結果已受限制。

source: Search result
zh_hant: 搜尋結果

source: of
zh_hant: 之

source: Previous match
zh_hant: 上一個符合項目

source: Next match
zh_hant: 下一個符合項目

source: The recording could not be exported.
zh_hant: 無法匯出這段錄音。

source: This recording cannot be exported because its saved metadata is invalid.
zh_hant: 無法匯出這段錄音，因為其儲存的中繼資料無效。

source: This recording is too large to export safely.
zh_hant: 這段錄音太大，無法安全匯出。

source: The complete recording could not be read for export.
zh_hant: 無法讀取完整錄音以供匯出。

source: The recording changed or failed its integrity check during export.
zh_hant: 匯出期間錄音已變更或未通過完整性檢查。

source: This recording does not have a saved transcript to export.
zh_hant: 這段錄音沒有可匯出的已儲存逐字稿。

source: This saved transcript contains invalid timing data and cannot be exported.
zh_hant: 這份已儲存的逐字稿包含無效時間資訊，無法匯出。

source: This transcript is too large to export safely.
zh_hant: 這份逐字稿太大，無法安全匯出。

source: There is not enough free space to create this export.
zh_hant: 可用空間不足，無法建立此匯出檔。

source: A secure temporary export file could not be created.
zh_hant: 無法建立安全的暫存匯出檔。

source: Add an outline title to a page to find it here.
zh_hant: 為頁面加入大綱名稱，即可在此快速找到。

source: Add to outline
zh_hant: 加入大綱

source: All
zh_hant: 全部

source: Bookmark a page to find it here.
zh_hant: 將頁面加入書籤，即可在此快速找到。

source: Bookmark page
zh_hant: 將頁面加入書籤

source: Bookmarks
zh_hant: 書籤

source: Clear outline
zh_hant: 清除大綱

source: Current page outline
zh_hant: 目前頁面的大綱

source: Maximum 120 characters.
zh_hant: 最多 120 個字元。

source: Navigator
zh_hant: 導覽器

source: No bookmarked pages
zh_hant: 沒有書籤頁面

source: No outline entries
zh_hant: 沒有大綱項目

source: Outline title
zh_hant: 大綱名稱

source: Page navigator
zh_hant: 頁面導覽器

source: Remove page bookmark
zh_hant: 移除頁面書籤

source: Save outline
zh_hant: 儲存大綱

source: Unlock
zh_hant: 解鎖

source: Wait for the academic workspace to finish its current operation.
zh_hant: 請等待目前的學術工作區操作完成。

source: This course is no longer active.
zh_hant: 這門課程已不再是進行中狀態。

source: The session start operation is no longer current.
zh_hant: 這次開始課堂的操作已不是目前操作。

source: There is no class session waiting for recovery.
zh_hant: 目前沒有等待復原的課堂。

source: The session recovery is no longer current.
zh_hant: 這次課堂復原已不是目前操作。

source: The saved class session does not match its recovery record. No note was changed.
zh_hant: 已儲存的課堂與復原記錄不一致；筆記未被變更。

source: The class session is missing its initial note page reference.
zh_hant: 這堂課缺少初始筆記頁面的參照。

source: The note creation result arrived too late.
zh_hant: 建立筆記的結果到達得太晚。

source: The class session is saved, but its text note still needs to be created.
zh_hant: 課堂已儲存，但仍需要建立文字筆記。

source: The session activation result arrived too late.
zh_hant: 啟用課堂的結果到達得太晚。

source: The active class session is missing its note page reference.
zh_hant: 進行中的課堂缺少筆記頁面參照。

source: The active class session still needs its linked text note.
zh_hant: 進行中的課堂仍需要建立已連結的文字筆記。

source: The saved class session conflicts with this recovery attempt. No note was changed.
zh_hant: 已儲存的課堂與這次復原衝突；筆記未被變更。

source: Finish preparing this class note before starting another session.
zh_hant: 請先完成這堂課的筆記準備，再開始另一堂課。

source: Preparing class note...
zh_hant: 正在準備課堂筆記⋯

source: Class note recovery
zh_hant: 課堂筆記復原

source: This session needs attention
zh_hant: 這堂課需要處理

source: Retry preparing note
zh_hant: 重試準備筆記

source: Open saved note
zh_hant: 開啟已儲存筆記

source: Class note unavailable
zh_hant: 課堂筆記無法使用

source: Return to the course and retry preparing this session's note.
zh_hant: 請返回課程並重試準備這堂課的筆記。

source: Preparing
zh_hant: 準備中

source: Start class
zh_hant: 開始上課

source: Resume class
zh_hant: 繼續上課

source: Resume the class already in progress.
zh_hant: 請繼續目前進行中的課堂。

source: Open class note
zh_hant: 開啟課堂筆記

source: Add a one-line class summary before finishing review.
zh_hant: 請先加入一行課堂摘要，再完成檢視。

source: Shorten the one-line class summary before finishing review.
zh_hant: 請縮短一行課堂摘要，再完成檢視。

source: Add a candidate name before marking it ready for later confirmation.
zh_hant: 將候選項目標記為「準備稍後確認」前，請先加入名稱。

source: Choose whether the candidate date is unknown, estimated, or confirmed.
zh_hant: 請選擇候選日期為未知、估計或已確認。

source: Add a reason before rejecting this marker.
zh_hant: 拒絕此標記前，請先加入原因。

source: Shorten the rejection reason before finishing review.
zh_hant: 請縮短拒絕原因，再完成檢視。

source: Check the selected marker's fields before finishing review.
zh_hant: 請檢查所選標記的欄位，再完成檢視。

source: That decision is not available for the marker's current state.
zh_hant: 目前標記狀態不支援此決定。

source: This review is frozen for a safe retry and can no longer be edited.
zh_hant: 此檢視已凍結以供安全重試，無法再編輯。

source: The saved class markers changed. Close and reopen this review.
zh_hant: 已儲存的課堂標記已變更。請關閉並重新開啟此檢視。

source: This class no longer needs a wrap-up.
zh_hant: 此課堂不再需要課後整理。

source: This class review could not be prepared safely.
zh_hant: 無法安全地準備此課堂檢視。

source: Candidate type
zh_hant: 候選項目類型

source: Candidates
zh_hant: 候選項目

source: Assignment and exam markers from this class will appear here.
zh_hant: 此課堂的作業與考試標記會顯示在這裡。

source: Review its saved source and decide what should happen next.
zh_hant: 檢視已儲存的來源，並決定下一步。

source: Name not added yet
zh_hant: 尚未加入名稱

source: This completed class is read-only here.
zh_hant: 此已完成的課堂在此為唯讀。

source: Candidate review
zh_hant: 候選項目檢視

source: Saving candidate review
zh_hant: 正在儲存候選項目檢視

source: Ready for later confirmation records a reviewed candidate only. It does not create a formal assignment, exam, notification, or hard deadline.
zh_hant: 「準備稍後確認」只會記錄已檢視的候選項目，不會建立正式作業、考試、通知或硬性期限。

source: Candidate
zh_hant: 候選項目

source: Saved source
zh_hant: 已儲存的來源

source: Details
zh_hant: 詳細資料

source: Candidate name
zh_hant: 候選項目名稱

source: Scope or coverage
zh_hant: 範圍或涵蓋內容

source: Date certainty
zh_hant: 日期確定程度

source: Date
zh_hant: 日期

source: The saved date cannot be represented in this course time zone. Choose a new date or mark it unknown before saving.
zh_hant: 無法在此課程時區表示已儲存的日期。儲存前請選擇新日期，或將日期標記為未知。

source: Save draft
zh_hant: 儲存草稿

source: Keep in Needs Details
zh_hant: 保留為「需要詳細資料」

source: Ready for later confirmation
zh_hant: 準備稍後確認

source: Reason for rejecting this marker
zh_hant: 拒絕此標記的原因

source: Reject candidate
zh_hant: 拒絕候選項目

source: Decision
zh_hant: 決定

source: Retry the same review
zh_hant: 重試相同檢視

source: Reload saved candidate
zh_hant: 重新載入已儲存的候選項目

source: Retrying reuses the exact same fields, audit identifiers, and review time.
zh_hant: 重試會沿用完全相同的欄位、稽核識別碼與檢視時間。

source: Academic data is still unavailable. Try again.
zh_hant: 學術資料仍無法使用，請再試一次。

source: Candidate review saved.
zh_hant: 候選項目檢視已儲存。

source: This candidate changed elsewhere. The newer saved version was not overwritten.
zh_hant: 此候選項目已在其他位置變更；較新的已儲存版本未被覆寫。

source: This candidate is no longer in the saved class.
zh_hant: 此候選項目已不在已儲存的課堂中。

source: The review is ready, but academic data could not be saved.
zh_hant: 檢視內容已準備好，但無法儲存學術資料。

source: Choose a valid date in the course time zone or mark the date unknown.
zh_hant: 請在課程時區選擇有效日期，或將日期標記為未知。

source: Captured source
zh_hant: 擷取時的來源

source: Quick capture
zh_hant: 快速擷取

source: Checking the saved paragraph
zh_hant: 正在檢查已儲存的段落

source: Current paragraph (changed)
zh_hant: 目前段落（已變更）

source: NextStep will not guess or move this marker to different text.
zh_hant: NextStep 不會猜測來源，也不會把此標記移到其他文字。

source: Retry source check
zh_hant: 重新檢查來源

source: Finish or discard the pending class marker first.
zh_hant: 請先完成或捨棄待處理的課堂標記。

source: Stop and save the audio recording before ending class.
zh_hant: 結束課堂前，請先停止並儲存錄音。

source: Wait for academic data to become available.
zh_hant: 請等待學術資料恢復可用。

source: Wait for the library change to finish.
zh_hant: 請等待資料庫變更完成。

source: The class status changed while the end confirmation was open. Review the current saved session.
zh_hant: 結束確認畫面開啟期間，課堂狀態已變更。請檢視目前已儲存的課堂。

source: The class status changed while review was open. No review decision was overwritten.
zh_hant: 檢視畫面開啟期間，課堂狀態已變更。沒有任何檢視決定被覆寫。

source: This class is no longer available for candidate review.
zh_hant: 此課堂已無法進行候選項目檢視。

source: Saving this note before class review
zh_hant: 正在課堂檢視前儲存此筆記

source: The note could not be saved safely. Class status was not changed. Retry the note save before ending class.
zh_hant: 無法安全地儲存筆記，課堂狀態未變更。結束課堂前，請重試儲存筆記。

source: The class changed while its note was being saved. Review the current status and try again.
zh_hant: 儲存筆記期間，課堂已變更。請檢視目前狀態後再試一次。

source: The note could not be saved safely. Candidate review was not opened. Retry the note save first.
zh_hant: 無法安全地儲存筆記，因此未開啟候選項目檢視。請先重試儲存筆記。

source: The note could not be saved safely. The class review was not opened. Retry the note save first.
zh_hant: 無法安全地儲存筆記，因此未開啟課堂檢視。請先重試儲存筆記。

source: This class changed elsewhere. No class status was overwritten.
zh_hant: 此課堂已在其他位置變更，沒有任何課堂狀態被覆寫。

source: The note is safe, but the class status could not be saved.
zh_hant: 筆記已安全儲存，但無法儲存課堂狀態。

source: This class is not ready for review. Reopen the saved session and try again.
zh_hant: 此課堂尚未準備好進行檢視。請重新開啟已儲存的課堂後再試一次。

source: End class
zh_hant: 結束課堂

source: Review class
zh_hant: 檢視課堂

source: Saved on this iPad
zh_hant: 已儲存在此 iPad

source: Class markers
zh_hant: 課堂標記

source: Assignment and exam candidates
zh_hant: 作業與考試候選項目

source: Ready to end class
zh_hant: 可以結束課堂

source: Ending class stops new class markers. Your note stays available and editable.
zh_hant: 結束課堂後將停止新增課堂標記；筆記仍可使用及編輯。

source: End and review now
zh_hant: 結束並立即檢視

source: End and review later
zh_hant: 結束並稍後檢視

source: Review later is safe: this class will remain in Needs Review after relaunch.
zh_hant: 稍後檢視是安全的：重新啟動後，此課堂仍會維持「需要檢視」狀態。

source: Retry ending class
zh_hant: 重試結束課堂

source: The note is safe
zh_hant: 筆記已安全儲存

source: Only the class status failed to save. Retrying reuses the same end request.
zh_hant: 只有課堂狀態儲存失敗；重試會沿用相同的結束請求。

source: The saved class status changed or this request is no longer valid. Close this sheet and review the current session.
zh_hant: 已儲存的課堂狀態已變更，或此請求已失效。請關閉此畫面並檢視目前課堂。

source: Ending class
zh_hant: 正在結束課堂

source: Show more markers
zh_hant: 顯示更多標記

source: Markers are shown in small batches so a large class remains responsive.
zh_hant: 標記會分成小批顯示，讓標記較多的課堂仍能順暢操作。

source: Class wrap-up
zh_hant: 課後整理

source: Review later
zh_hant: 稍後檢視

source: Finish review
zh_hant: 完成檢視

source: Saving class review
zh_hant: 正在儲存課堂檢視

source: Markers to review
zh_hant: 待檢視的標記

source: Choose one outcome for each marker. Ready for later confirmation does not create a formal assignment, exam, or deadline yet.
zh_hant: 請為每個標記選擇一個結果。「準備稍後確認」目前不會建立正式作業、考試或期限。

source: 2–5 minute review
zh_hant: 2–5 分鐘檢視

source: Already rejected
zh_hant: 已拒絕

source: Resolved marker
zh_hant: 已處理的標記

source: Reason for removing this marker
zh_hant: 移除此標記的原因

source: Review notes
zh_hant: 檢視筆記

source: What mattered in this class?
zh_hant: 這堂課的重要內容是什麼？

source: One-line class summary
zh_hant: 一行課堂摘要

source: Keep
zh_hant: 保留

source: Needs details
zh_hant: 需要詳細資料

source: No new actions to confirm
zh_hant: 沒有新的行動需要確認

source: Outcome preview
zh_hant: 結果預覽

source: V1 records review decisions only. Formal assignments, exams, hard deadlines, and planning are added in the next approved phase.
zh_hant: V1 只記錄檢視決定；正式作業、考試、硬性期限與規劃功能會在下一個核准階段加入。

source: Retry saving review
zh_hant: 重試儲存檢視

source: This date cannot be represented in the course time zone.
zh_hant: 無法在課程時區表示此日期。

source: This class changed elsewhere. No review decision was overwritten.
zh_hant: 此課堂已在其他位置變更，沒有任何檢視決定被覆寫。

source: One or more review fields is invalid or too long.
zh_hant: 一個或多個檢視欄位無效或過長。

source: Discard pending marker
zh_hant: 捨棄待處理的標記

source: Assignments
zh_hant: 作業

source: Exams
zh_hant: 考試

source: To review
zh_hant: 待檢視

source: New candidate
zh_hant: 新候選項目

source: Resolved
zh_hant: 已處理

source: Unknown
zh_hant: 未知

source: Estimated
zh_hant: 估計

source: Confirmed
zh_hant: 已確認

source: Review needs attention
zh_hant: 檢視需要處理

source: Safe retry available
zh_hant: 可安全重試

source: Matches captured source
zh_hant: 與擷取時的來源相符

source: Source needs relocation: paragraph changed after capture
zh_hant: 來源需要重新定位：段落在擷取後已變更

source: This older marker has no source hash to verify
zh_hant: 此較舊的標記沒有可供驗證的來源雜湊

source: Source needs relocation: paragraph was removed
zh_hant: 來源需要重新定位：段落已被移除

source: Source is temporarily unavailable
zh_hant: 來源暫時無法使用

source: Keep marker
zh_hant: 保留標記

source: Reject marker
zh_hant: 拒絕標記

source: The review is ready to retry
zh_hant: 可重試此檢視

source: Retrying reuses the exact same decisions, identifiers, and completion time.
zh_hant: 重試會沿用完全相同的決定、識別碼與完成時間。
